{
    "jobs" : [
        {
            "position": "ModelOps Engineer",
            "company" : "Trax Retail",
            "tenure" : "May 2022 - Present",
            "type": "Full-time",
            "remote" : true,
            "logo" : "https://i.imgur.com/08s43GZ.png",
            "desc" : [
                "Led the end-to-end training, management, and deployment of 300+ unique AI (Computer Vision) models seamlessly into various client-specific business environment",
                " Served as Assistant Team Leader, overseeing daily operations, maintaining project momentum, and ensuring continuity",
                "Designed and implemented multiple CI/CD pipelines to automate workflows, including data processing, testing, model training, validation, and deployment, reducing manual intervention by 50%, accelerating deployment cycles by 30%, and cutting operation cost by at least 50%",
                "Developed and enhanced several components of our AI engine, boosting performance by 25%, and enhancing overall functionality to support the clients' requirements",
                "Implemented automated analytical reporting upon engine training completion, leveraging test results to generate intuitive visualizations and provide deeper insights into model performance, reducing manual reporting time by 60%",
                "Primarily responsible for diagnosing underperforming deployed AI models across 300+ active projects and implementing effective solutions to address each of their issues",
                "Resolved numerous bugs and enhanced existing features in the legacy codebase",
                "Developed comprehensive unit and integration tests, and enhancing code quality and maintainability, resulting in a 30% reduction in production bugs",
                " Founding member of a global AI team, collaborating with AI/ML engineers and data scientists worldwide to foster consistent knowledge sharing and innovation"
            ]
        },
        {
            "position": "Software Developer",
            "company" : "DevSoft Philippines",
            "tenure" : "APR 2021 - MAY 2022",
            "type": "Full-time",
            "remote" : false,
            "logo" : "https://i.imgur.com/rb8uzTK.png",
            "desc" : [
                "Responsible in writing clean code related to the application of DevExpress products into a client specific business environment",
                "Was in charge of ASP.NET Web Forms, MVC, and Blazor support for DevExpress clients",
                "Provided real-time client support on how to implement DevExpress Components in their projects",
                "Created several use-case examples published on the DevExpress website, demonstrating practical applications of the platform",
                "Resolved numerous bugs and enhanced existing features in the legacy codebase to improve functionality and stability",
                "Works with DevExpress developers to find bugs, troubleshoot, and improve existing products",
                "Was responsible for creating documentation for proper product implementation and troubleshooting procedures"
            ]
        },
        {
            "position": "Automation Equipment Service Engineer",
            "company" : "P.IMES",
            "tenure" : "JAN 2020 - APR 2021",
            "type": "Full-time",
            "remote" : false,
            "logo" : "https://i.imgur.com/P5DrEs9.png",
            "desc" : [
                "Supervised all service operations of the company throughout the Philippines",
                "Hands-on with both the assembly and troubleshooting of robots and other automation machines",
                "Successfully managed projects that were delivered way ahead of schedule and under budget",
                "Contributed to the mechanical/electrical design of most automation machines",
                "Introduced several guidelines and created various tools using in-house materials to decrease production costs while increasing workflow efficiency"
            ]
        }
    ],
    "skills": [
    {
      "name": "Python",
      "proficiency": 90,
      "logo": "https://i.imgur.com/OnLONPO.png"
    },
    {
      "name": "C#",
      "proficiency": 80,
      "logo": "https://i.imgur.com/IuCEszH.png"
    },
    {
      "name": "C++",
      "proficiency": 70,
      "logo": "https://i.imgur.com/9itlz0H.png"
    },
    {
      "name": "Pytorch",
      "proficiency": 80,
      "logo": "https://i.imgur.com/WXlH2q1.png"
    },
    {
      "name": "Tensor Flow",
      "proficiency": 80,
      "logo": "https://i.imgur.com/Jda2oYx.png"
    },
    {
      "name": "Open CV",
      "proficiency": 80,
      "logo": "https://i.imgur.com/7YClMMv.png"
    },
    {
        "name": "AWS",
        "proficiency": 60,
        "logo": "https://i.imgur.com/TUUZfgc.png"
      },
      {
        "name": "ASP.NET",
        "proficiency": 80,
        "logo": "https://i.imgur.com/RxJGXIN.png"
      },
      {
        "name": "Git",
        "proficiency": 80,
        "logo": "https://i.imgur.com/0t0yGVN.png"
      },
      {
        "name": "Kubernetes",
        "proficiency": 50,
        "logo": "https://i.imgur.com/lk3KEPo.png"
      },
      {
        "name": "Django",
        "proficiency": 70,
        "logo": "https://i.imgur.com/iiPcWSH.png"
      },
      {
        "name": "Flask",
        "proficiency": 60,
        "logo": "https://i.imgur.com/XwhANb3.png"
      },
      {
        "name": "Javascript",
        "proficiency": 80,
        "logo": "https://i.imgur.com/tmHOzOF.png"
      },
      {
        "name": "Matlab",
        "proficiency": 60,
        "logo": "https://i.imgur.com/lY5Kiyl.png"
      },
      {
        "name": "AutoCAD",
        "proficiency": 90,
        "logo": "https://i.imgur.com/xechiIZ.png"
      },
      {
        "name": "SolidWorks",
        "proficiency": 90,
        "logo": "https://i.imgur.com/4zZa4b6.png"
      },
      {
        "name": "MySQL",
        "proficiency": 90,
        "logo": "https://i.imgur.com/mIffeqU.png"
      },
      {
        "name": "MongoDB",
        "proficiency": 90,
        "logo": "https://i.imgur.com/OTelgS6.png"
      }
  ],
  "projects" : [
    {
        "title": "AI Papers Implementations",
        "desc" : "List of AI papers I tried to implement so far: Multi-Head Attention Transformer - Attention Is All You Need, Generative Adversarial Network, Faster R-CNN: Towards Real-Time Object Detection with Region Proposal Networks",
        "link" : "https://github.com/lloydaxeph/ai_paper_implementations",
        "background": "https://i.imgur.com/43qbz7p.png"
    },
    {
        "title": "Sign Language Translator",
        "desc" : "A simple model that will detect specific human actions with just a few samples for training. Intended to be used as a live sign language translator.",
        "link" : "https://github.com/lloydaxeph/sign_language_detector",
        "background": "https://i.imgur.com/keuffcS.png"
    },
    {
        "title": "Lifebuoy Carrying Quadcopter Drone",
        "desc" : "The following is one of our undergraduate project where we made a drone out of store-bought part. This drone was designed to carry and drop a lifebuoy near an active drowning victim where he/she can reach easily and where she can stay afloat while waiting for the rescuer to arrive.",
        "link" : "https://github.com/lloydaxeph/lifebuoy_carrying_drone",
        "background": "https://i.imgur.com/5k9iy8p.png"
    },
    {
        "title": "AI Language Translator",
        "desc" : "This project aims to train and use a multi-head attention transformer model to translate German text to English. Dataset that will be used in this implemenation is the Multi30k dataset. The model that will be used is the Multi-Head Self-Attention Transformer model I created from scratch.",
        "link" : "https://github.com/lloydaxeph/german_english_translator",
        "background": "https://i.imgur.com/dxKjml8.png"
    },
    {
        "title": "CopyCase Website",
        "desc" : "A website that automatically downloads specific Philippine legal case documents from the internet in a single click of a button.",
        "link" : "https://github.com/lloydaxeph/copycase",
        "background": "https://i.imgur.com/YdE9uTB.png"
    },
    {
      "title": "IELTSGO! AI powered IELTS Practice Website",
      "desc" : "A free website that lets you practice several skills related to IELTS. AI is used to review and evaluate your answers.",
      "link" : "https://www.ieltsgo.net",
      "background": "https://imgur.com/Q7Ah0Q7.png"
    },
    {
        "title": "Cloud-Atlas Weather App",
        "desc" : "Real-time interactive weather dashboard made using Angular",
        "link" : "https://github.com/lloyd-axe/cloud-atlas",
        "background": "https://imgur.com/BjOEiqM.png"
    },
    {
      "title": "AI in HVAC",
      "desc" : "Repository for different types of AI implementations related to HVAC.",
      "link" : "https://github.com/lloyd-axe/ai_in_hvac",
      "background": "https://imgur.com/BEXYA2Q.png"
    }
  ]
}
